<?php
echo '<h1>Занятие 3: Циклы</h1><br>';

// ============= While ===========
/*
$x = 1;
while ($x <= 10) {
    if ($x != 8) {
        echo $x . ' ';
    }

    $x++;
}
*/

// ============= Do While =============
/*
$x = 1;
do {
    echo $x . ' ';
    $x++;
} while ($x <= 10);
*/
// =============== For ====================
/*
for ($i = 1; $i <= 10; $i++) {
    echo $i . ' ';
}
*/

$arr = [];
for ($i = 1; $i <= 10; $i++) {
    $arr[] = $i;
//    $arr[$i] = $i;
}

/*
for ($i = 0; $i <= 10; $i++) {
    if ($i % 2 == 0 && $i != 0) {
        echo $i . ' ';
    }
}
*/
/*
// получаем все високосные года
for ($i = 1901; $i <= 2019; $i++) {
    if ($i % 4 == 0) {
        echo $i . ' ';
    }
}
*/

// ================ Foreach ============
/*
foreach ($arr as $key => $value) {
    echo 'Ключ: ' . $key . '. Значение: ' . $value . '<br>';
}
*/
/*
foreach ($arr as $value) {
    echo 'Ключ: ' . '. Значение: ' . $value . '<br>';
}
*/
/*
for ($i = 0; $i < count($arr); $i++) {
    echo 'Ключ: ' . $i . '. Значение: ' . $arr[$i] . '<br>';
}
*/

// ===================== Вложенные циклы ==================
/*
$mass = [];
for ($i = 0; $i < 10; $i++) {
    for ($j = 9; $j >= 0; $j--) {
        $mass[$i][$j] = $i + $j;
    }
}
foreach ($mass as $k1 => $v1) {
    foreach ($v1 as $k2 => $v2) {
        echo $k1 . ' + ' . $k2 . ' = ' . $v2 . '<br>';
    }
}
*/




